import pandas as pd

data = {"ID": ["kim", "park", "han", "choi", "seo"],
 "상품": ["상품A", "상품B", "상품C", "상D", "상품E"],
 "가격": [15000, 23000, 33000, 50000, 60000],
 "개수": [3, 5, 1, 10, 7],
 "구매일":["0303", "0810", "0120", "0601", "0124"]
 }

df = pd.DataFrame(data, index=["01", "02", "03", "04", "05"])
print(df.iloc[2, 0])
print(df.loc["03", "ID"])
print("--------------------------------------")                 
print(df.iloc[3, :2])
print(df.loc["04", :"상품"])
print("--------------------------------------")        
print(df.iloc[:, [0, 4]])
print(df.loc[:, ["ID", "구매일"]])
